# Arithmetic expression interpreter -- v2

This version only operators with different arities. For example:

```
> (abs -3)
3
> (odd 5)
1
> (? 1 2 3)
2
> (? 0 2 3)
3
``` 
